# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/cask-fonts"

# Brew extensions and helper
# Install applications from Mac App Store
brew "mas"

# Python
# we need to install different versions
# brew install python
# brew install python@3.7
# brew pin python@3.7
# brew link --overwrite --force python@3.7
# add "/usr/local/opt/python@3.7/libexec/bin" to path
brew "python"
brew "python@3.7", link: true

# zon dev environment
brew "graphviz"
brew "nginx"
brew "libevent"
brew "libjpg"
brew "libmagic"
brew "libffi"
brew "libmemcached"
brew "webp"
brew "node"
brew "pkg-config"
brew "wget"

# Browsers
#already-preinstalled# cask "firefox"
cask "firefox-nightly"
#cask "firefox-developer-edition"
#already-preinstalled# cask "google-chrome"
#cask "google-chrome-canary"
cask "opera"

# chromium is mandatory for testing purposes
cask "chromium"
brew "geckodriver"
cask "chromedriver"

# IDE/Editors
cask "atom"
cask "sublime-text"
cask "visual-studio-code"

# Version Control
brew "git"
brew "git-trim"
brew "gh" # https://cli.github.com/
brew "git-quick-stats"

# Documentation
brew "sphinx-doc"

# File- and documentsharing
#cask "google-drive"

# useful mac software
cask "tunnelblick"
cask "iterm2"
cask "dropbox"
cask "alfred"
cask "spotify"
cask "keepassxc"
cask "spectacle"
cask "glyphfinder"
cask "thunderbird"
cask "keybase"
cask "stretchly"
cask "numi"
cask "notion"
cask "zoom"
#already-preinstalled# cask "slack"
#already-preinstalled# cask "starleaf"

#cask "appcleaner"
#cask "colour-contrast-analyser"
#cask "free-ruler"
#cask "the-unarchiver"
#cask "openoffice"
#cask "postgres"


# useful shell tools
#brew "ack"
brew "bat"
brew "bit-git"
brew "httpie"
#brew "autojump"#comes via zsh "z" plugin
#brew "ssh-copy-id"
#cask "ngrok"
#brew "ffmpeg"
#brew "imagemagick"
cask "docker"
brew "kubernetes-cli"
brew "tfenv"
#brew "kustomize" # :-( https://github.com/ZeitOnline/zeit.web/commit/069b233

cask "insomnia"
cask "insomnia-designer"

# zsh shell
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

cask "font-fira-code"

# Install manually:
# Pocket
